In [1]:
import numpy as np
import pandas as pd

In [12]:
df = pd.read_excel('/Users/finn/Documents/GitHub/data/e4e5/Uncleaned Data/US_Assets.xlsx')

In [13]:
df = df.melt(id_vars=["Rank","Country"], var_name="Type", value_name="Value")

In [14]:
df.to_csv("/Users/finn/Documents/GitHub/data/e4e5/US_Assets.csv", index=False)

In [15]:
df

     Rank                 Country        Type   Value
0       1          United Kingdom       Total  2469.0
1       2                   Japan       Total  2366.0
2       3          Cayman Islands       Total  2313.0
3       4              Luxembourg       Total  2096.0
4       5                  Canada       Total  1850.0
..    ...                     ...         ...     ...
120    21                  Sweden  Short-Term     1.0
121    22            Saudi Arabia  Short-Term    20.0
122    23                  Brazil  Short-Term     1.0
123    24                   India  Short-Term     3.0
124    25  British Virgin Islands  Short-Term     8.0

[125 rows x 4 columns]